// 可配置体温单版本(common)专用配置文件

// 医院名称
window.hospitalName = '医院名称' // 如需不显示医院名称可以直接设置为空字符串''

// 体温单名称
window.temperatureListName = '体温单'

// 时间点数组
window.timePointList = [4, 8, 12, 16, 20, 24] // [4, 8, 12, 16, 20, 24]/[2, 6, 10, 14, 18, 22]

// 表底信息的配置数组（vitalCode需要使用统一的code值，label是表底信息左侧的标签文字，自定义的不需要设置label，设置空字符串''就行）
window.tableBottomList = [
  { vitalCode: '04', label: '呼吸(次/分)' },
  { vitalCode: '061', label: '大便(次/日)' },
  { vitalCode: '062', label: '血压(mmHg)' },
  { vitalCode: '094', label: '身高(cm)' },
  { vitalCode: '033', label: '体重(kg)' },
  { vitalCode: '091', label: '总入量(ml)' },
  { vitalCode: '19', label: '总出量(ml)' },
  { vitalCode: '10', label: '引流量(ml)' },
  { vitalCode: '12', label: '尿量(ml)' },
  { vitalCode: '32', label: '123' },
  { vitalCode: '33', label: '' },
  { vitalCode: '34', label: '' },
  { vitalCode: '35', label: '' }
]

// vitalCode值映射表，左边是统一的vitalCode值，右边是医院实际的vitalCode值(可动态配置)
window.vitalCodeMap = {
  '5': '5', // 表顶注释 入院|,手术,分娩|,出院|,转入|,死亡|,排胎|,出生|,手术分娩|,手术入院|,转出|
  '4': '4', // 表底注释 拒测,不在,外出不升,请假,右PPD,左PPD,冰敷,退热贴,冷水枕,降温毯,温水浴,辅助呼吸,PDD停辅助呼吸
  '01': '01', // 腋温
  '02': '02', // 脉搏
  '20': '20', // 心率
  '04': '04', // 呼吸
  '062': '062', // 血压
  '12': '12', // 尿量
  '091': '091', // 入量
  '19': '19', // 出量
  '033': '033', // 体重
  '043': '043', // 肛温
  '041': '041', // 口温
  '21': '21', // 发热体温
  '22': '22', // 线上降温
  '23': '23', // 呼吸机R
  '061': '061', // 大便次数
  '10': '10', // 引流量
  '25': '25', // 护理事件
  '27': '27', // 物理降温
  '28': '28', // 呕吐量
  '29': '29', // 在线降温
  '092': '092', // 疼痛评分
  '094': '094', // 身高
  '3': '3', // 物理降温
  '32': '32', // 自定义1
  '33': '33', // 自定义2
  '34': '34', // 自定义3
  '35': '35', // 自定义4
  '36': '36', // 自定义5
  '37': '37' // 自定义6
}
